spec/fixtures/vcr_casettes/valid_partial_credit.yml

---
http_interactions:
- request:
    method: post
    uri: https://sandbox.affirm.com/api/v2/charges/N330-Z6D4/refund
    body:
      encoding: UTF-8
      string: '{"amount":1000}'
    headers:
      Authorization:
      - Basic WFBTUTNDQTdQTE43Q0pDSzp3OW14a1FVcnlLalRZRHFPZlN2WVRlVEdvTElVUktwVQ==
      User-Agent:
      - Faraday v0.9.2
      Content-Type:
      - application/json
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - no-cache
      Content-Type:
      - application/json
      Date:
      - Thu, 02 Feb 2017 21:11:10 GMT
      Server:
      - openresty
      Strict-Transport-Security:
      - max-age=86400; includeSubDomains
      X-Affirm-Request-Id:
      - 0306c002-b282-4c24-cc09-dea2f1149fc7
      Content-Length:
      - '172'
      Connection:
      - keep-alive
    body:
      encoding: UTF-8
      string: '{"created": "2017-02-02T21:11:09Z", "fee_refunded": 30, "currency":
        "USD", "amount": 1000, "type": "refund", "id": "Q9V5OSY77YIZN8S0", "transaction_id":
        "tFpFOCQrW3b8UxDU"}'
    http_version: 
  recorded_at: Thu, 02 Feb 2017 21:11:10 GMT
recorded_with: VCR 3.0.3
